diplom-src/src/Catalogs/ДоговорыКонтрагентов/ДоговорыКонтрагентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ДоговорыКонтрагентов</name>
  <owners>Catalog.Контрагенты</owners>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидДоговора</name>
    <type>
      <types>EnumRef.ВидыДоговоровКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_ДействуетС</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_ДействуетПо</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_АбонентскаяПлата</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_СтомостьЧасаРаботы</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

diplom-src/src/Enums/ВидыДоговоровКонтрагентов/ВидыДоговоровКонтрагентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыДоговоровКонтрагентов</name>
  <enumValues>
    <name>Поставщик</name>
  </enumValues>
  <enumValues>
    <name>Покупатель</name>
  </enumValues>
  <enumValues>
    <name>ВКМ_АбонентскоеОбслуживание</name>
  </enumValues>
</mdclass:Enum>

diplom-src/src/Catalogs/ДоговорыКонтрагентов/Forms/ВКМ_ФормаЭлемента/Module.bsl
//ВКМ_Вывод реквизитов на форму при выборе ВидДоговора - АбонентскийДоговор
&НаКлиенте
Процедура ВидДоговораПриИзменении(Элемент)
	ВидДоговораПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура ВидДоговораПриИзмененииНаСервере()
		
	Если Объект.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.ВКМ_АбонентскоеОбслуживание Тогда
		
		//Создаем группу для периода и добавляем туда элементы
		ГруппаПериод = Элементы.Добавить("ГруппаОбычная", Тип("ГруппаФормы"));
		ГруппаПериод.Вид = ВидГруппыФормы.ОбычнаяГруппа;
		ГруппаПериод.ОтображатьЗаголовок = Ложь;
		ГруппаПериод.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;
		
		Если Элементы.Найти("ВКМ_ДействуетС") = Неопределено Тогда
			НовыйЭлемент = Элементы.Добавить("ВКМ_ДействуетС", Тип("ПолеФормы"), ГруппаПериод);
			НовыйЭлемент.ПутьКДанным = "Объект.ВКМ_ДействуетС";
			НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
		КонецЕсли;	
		Если Элементы.Найти("ВКМ_ДействуетПо") = Неопределено Тогда
			НовыйЭлемент = Элементы.Добавить("ВКМ_ДействуетПо", Тип("ПолеФормы"), ГруппаПериод);
			НовыйЭлемент.ПутьКДанным = "Объект.ВКМ_ДействуетПо";
			НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
		КонецЕсли;
		////////////////////////////////////////////////////////
		
		//Создаем элементы АбонентскаяПлата и СтомостьЧасаРаботы
		Если Элементы.Найти("ВКМ_АбонентскаяПлата") = Неопределено Тогда
			НовыйЭлемент = Элементы.Добавить("ВКМ_АбонентскаяПлата", Тип("ПолеФормы"));
			НовыйЭлемент.ПутьКДанным = "Объект.ВКМ_АбонентскаяПлата";
			НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
		КонецЕсли;
		Если Элементы.Найти("ВКМ_СтомостьЧасаРаботы") = Неопределено Тогда
			НовыйЭлемент = Элементы.Добавить("ВКМ_СтомостьЧасаРаботы", Тип("ПолеФормы"));
			НовыйЭлемент.ПутьКДанным = "Объект.ВКМ_СтомостьЧасаРаботы";
			НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
		КонецЕсли;
		////////////////////////////////////////////////////////
		
	КонецЕсли;
	
КонецПроцедуры
//ВКМ_Вывод реквизитов на форму при выборе ВидДоговора - АбонентскийДоговор
